
const HOUSE_NAMES = ["โบสถ์เก่า", "สถานีวิทยุประจำเมือง", "หอเฝ้าระวังไฟ"];
 
const ITEM_LIBRARY = {
  portableradio: { name:"วิทยุพกพา", image:"#", desc:"วิทยุเครื่องเล็กใส่ถ่าน AA สองก้อน เมื่อเปิดฟังจะเจอแต่เสียงคลื่นซ่า", rare:false },
  oldnewspaper: { name:"หนังสือพิมพ์แมรี่ฮิลล์สฉบับเก่า", image:"#", desc:"หนังสือพิมพ์ฉบับเดือนก่อน หน้าคดีอาชญากรรมถูกตัดออกไป แต่ยังเห็นหัวข้อข่าวเล็กๆ", rare:false },
  vhstape: { name:"ม้วนเทป VHS ไร้ชื่อ", image:"#", desc:"ม้วนเทปวิดีโอสีดำที่ไม่มีป้ายชื่อ เขียนด้วยปากกาเคมีแค่นักเลข 1997-04-12", rare:false },
  expiredmilk: { name:"นมหมดอายุ", image:"#", desc:"สภาพไม่ดี รสชาติแย่ สภาพแย่กินก็ไม่ได้ แม้จะดูเหมือนว่าจะหมดอายุอีกหลายเดือนข้างหน้า แต่ข้างในเน่าไปแล้ว ข้างๆมีกระกาศตามหาคนหาย", rare:false },
  cassettetape: { name:"ตลับเทปเพลง", image:"#", desc:"ตลับเทปเพลงของศิลปินยุค 80s สภาพสายเทปหย่อนยาน ฟังแล้วเสียงยานเหมือนเสียงผีหลอก ไม่มีประโยชน์ในการเอาชีวิตรอด แต่เอาไว้ใส่เครื่อง Walkman เปิดฟังแก้เหงาได้", rare:false },
  goodwood: { name:"ไม้หน้าสามสภาพดี", image:"#", desc:"ไม้ท่อนหนาแข็งแรงที่ไร้รอยปลวก เหมาะสำหรับเอาไปตอกตรึงประตูหลักหรือหน้าต่าง ทอยเต๋าซ่อมบ้านสำเร็จได้ง่าย และบวกค่าทนทานบ้านสูง", rare:false },
  badwood: { name:"เศษไม้ผุปลวกกิน", image:"#", desc:"แผ่นไม้เก่าเปียกชื้นที่ถูกปลวกกินจนเป็นโพรงข้างใน", rare:false },
  Matchbox: { name:"เทียนไข + กล่องไม้ขีด", image:"#", desc:"เทียนไขเล่มหนาจากโบสถ์ประจำเมือง ใช้จุดให้แสงสว่างในช่วงที่ไฟดับ", rare:false },
  goodnailbox: { name:"กล่องตะปูไร้สนิม", image:"#", decs:"กล่องตะปูเหล็กกล้าแหลมคมพร้อมใช้งาน ใช้คู่กับแผ่นไม้เพื่อซ่อมบ้าน", rare:false },
  badnailbox: { name:"ตะปูสนิมเขร็ดคดงอ", image:"#", decs:"กำตะปูเก่าที่ทั้งขึ้นสนิมและดื้อคดงอ ใช้ตอกไม้ยากมาก", rare:false },
  bigcandle: { name:"เทียนเล่มหนา", image:"#", decs:"เทียนไขเนื้อดีเล่มใหญ่ จุดได้นานตลอดทั้งคืน ช่วยให้ห้องหลบภัยไม่มืดมิด ลดการสูญเสียสติของทุกคนในห้องได้ดีเยี่ยม", rare:false },
  smallcandle: { name:"เศษเทียนไขก้อนเล็ก", image:"#", decs:"เศษเทียนก้นกุฏิที่เหลือความยาวไม่ถึงนิ้ว จุดให้แสงสว่างได้แค่อึดใจเดียวก็ดับลง ไม่ค่อยช่วยคลายความกลัวในความมืดเท่าไหร่นัก", rare:false },
  goodlighter: { name:"ไฟแช็ก สภาพดี", image:"#", decs:"ไฟแช็กเหล็กทรงเก๋ยุค 90s จุดติดง่าย ลมพัดก็ไม่ดับง่ายๆ มีน้ำมันเต็มถัง พร้อมใช้จุดเทียน จุดเตา หรือใช้จุดไฟขู่สิ่งเหนือธรรมชาติในความมืด", rare:false },
  badlighter: { name:"ไฟแช็กพลาสติกไร้น้ำมัน", image:"#", decs:"ไฟแช็กพลาสติกราคาถูก กดแล้วมีแค่ประกายไฟแต่ไม่มีเปลวไฟออกมาเพราะน้ำมันหมด ต้องใช้ความพยายามสุ่มทอยเต๋าจุดหลายครั้งกว่าจะติดเศษเทียน", rare:false },
  cannedfood: { name:"สเต็กเนื้อกระป๋องเกรดดี", image:"#", decs:"สบียงกระป๋องตราสมอ สภาพฝาไม่บวม ไม่ลอก ให้สารอาหารและความอิ่มสูง ช่วยฟื้นฟูค่าเสบียงกลางของบ้านได้เป็นอย่างมาก", rare:false },
  cannedtomato: { name:"ซุปมะเขือเทศกระป๋องบวมปูด", image:"#", decs:"กระป๋องอาหารที่มีอาการฝาบวมเต่งและมีกลิ่นเปรี้ยวเล็ดลอดออกมา แสดงถึงแบคทีเรียข้างใน ถ้าจวนตัวจนต้องกินแก้หิว จะต้องทอยเต๋าวัดดวงว่าท้องร่วงหรือไม่", rare:false },
  milkpowder: { name:"นมผง", image:"#", decs:"นมผงแบบชง สามารถชงดื่มเอาสารอาหารได้", rare:false },

  key:    { name:"กุญแจ", image:"Img/items/goldenkey.jpg", desc:"กุญแจดอกเก่าแก่ที่ถูกซ่อนไว้ใต้ลิ้นชักสถานีตำรวจ/อนามัย ใช้สำหรับเปิดประตูล็อคชั้นใต้ดินของโบสถ์", rare:true },
  brokenlocket: { name:"ล็อกเก็ตแตกร้าว", image:"Img/items/brokenlocket.jpg", desc:"ล็อกเก็ตเงินที่มีรูปถ่ายเก่าซีดจางอยู่ด้านใน มีเพียงชิ้นเดียวในโลก", rare:true },
  ritualcloth:  { name:"ผ้าพิธีต้องคำสาป", image:"Img/items/ritualcloth.jpg", desc:"ผ้าปักลวดลายพิธีกรรมโบราณ สัมผัสแล้วเย็นผิดปกติ มีเพียงชิ้นเดียวในโลก", rare:true }
};
 
// พื้นที่สำรวจ —
const AREAS = [
  { id:"districtoffice", name:"ที่ว่าการเมือง", pool:["portableradio", "goodnailbox", "badnailbox", "goodlighter"] },
  { id:"forest",      name:"ป่าทิศเหนือ", pool:["expiredmilk", "oldnewspaper", "key", "vhstape"] },
  { id:"oldchurch",        name:"โบสถ์ใหม่", pool:["Matchbox", "bigcandle", "badlighter", "cannedfood"] }
];
